[Killed] ConditionalExpression
src/analiseDeDados.js:71:11
     }
   
     calcularPercentil(percentil) {
-      if (this.dados.length === 0 || percentil < 0 || percentil > 100) return null;
+      if (false || percentil < 0 || percentil > 100) return null;
       const ordenado = this.ordenarDados();
       const index = (percentil / 100) * (ordenado.length - 1);
killedBy: Classe analise de dados Calcula o percentil do array - return null
statusReason: Error: expect(received).toBeNull()

Received: NaN
