[Killed] BlockStatement
src/banco.js:2:37
 class Banco {
-    constructor(nome, saldoInicial) {
-        this.nome = nome;
-        this.saldo = saldoInicial;
-        this.transacoes = [];
-    }
+    constructor(nome, saldoInicial) {}
 
     // Método 1: Depositar dinheiro
killedBy: Testes da classe Banco depositar 
statusReason: TypeError: Cannot read properties of undefined (reading 'push')
